# Stats - Baby Names

### Introduction:

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset

In [2]:
pd.read_csv("C:/pandas_data/US_Baby_Names - US_Baby_Names.csv")

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names=pd.read_csv("C:/pandas_data/US_Baby_Names - US_Baby_Names.csv")

In [4]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [10]:
del baby_names["Unnamed: 0"]

In [11]:
del baby_names["Id"]

### Step 6. Is there more male or female names in the dataset?

In [12]:
baby_names.Gender.value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

In [13]:
baby_names["Gender"].sort_values()

0          F
580540     F
580541     F
580542     F
580543     F
          ..
612570     M
612569     M
612568     M
612582     M
1016394    M
Name: Gender, Length: 1016395, dtype: object

In [16]:
baby_names.Gender.value_counts().head(1)

Gender
F    558846
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [27]:
name=baby_names.groupby("Name").sum()

In [28]:
name

,Unnamed: 0,Id,Year,Gender,State,Count
Name,,,,,,
Aaban,7733801,7733803,4027,MM,NYNY,12
Aadan,7158061,7158065,8039,MMMM,CACACATX,23
Aadarsh,1728030,1728031,2009,M,IL,5
Aaden,555052029,555052225,393963,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,ALALALALALALALARARARAZAZAZAZAZAZCACACACACACACA...,3426
Aadhav,709606,709607,2014,M,CA,6
...,...,...,...,...,...,...
Zyra,17538998,17539005,14085,FFFFFFF,CACACAFLTXTXTX,42
Zyrah,5487073,5487075,4024,FF,CATX,11
Zyren,5074229,5074230,2013,M,TX,6
Zyria,29787029,29787039,20089,FFFFFFFFFF,GAGAGALALALATXTXTXTX,59
Zyriah,34146196,34146205,18087,FFFFFFFFF,GAGALATXTXTXTXTXTX,58

### Step 8. How many different names exist in the dataset?

In [17]:
baby_names.nunique()

Name      17632
Year         11
Gender        2
State        51
Count      1949
dtype: int64

In [18]:
baby_names.Name.nunique()

17632

### Step 9. What is the name with most occurrences?

In [19]:
baby_names.Name.value_counts().head(1)

Name
Riley    1112
Name: count, dtype: int64

### Step 10. How many different names have the least occurrences?

In [23]:
baby_names.Name.value_counts().tail(5)

Name
Terryn     1
Yanna      1
Zemirah    1
Emmilyn    1
Coalton    1
Name: count, dtype: int64

In [29]:
name[name.Count == name.Count.min()]

          Unnamed: 0       Id  Year Gender State  Count
Name
Aadarsh      1728030  1728031  2009      M    IL      5
Aadin        5061279  5061280  2008      M    TX      5
Aaima        3746779  3746780  2013      F    NY      5
Aalaya        564906   564907  2014      F    CA      5
Aaminah       523794   523795  2004      F    CA      5
...              ...      ...   ...    ...   ...    ...
Zyien        5064199  5064200  2009      M    TX      5
Zyire        3853841  3853842  2007      M    NY      5
Zykeriah       89701    89702  2008      F    AL      5
Zykierra     1238449  1238450  2007      F    GA      5
Zymari       3179887  3179888  2009      M    NC      5

[2578 rows x 6 columns]

### Step 11. What is the median name occurrence?

In [31]:
name[name.Count == name.Count.median()]

         Unnamed: 0        Id   Year    Gender             State  Count
Name
Aishani     7810519   7810526  14078   FFFFFFF    CACACACACAILNJ     49
Alara      18841019  18841027  16079  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse     22629397  22629405  16057  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir      21780403  21780411  16086  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely       4349533   4349541  16071  FFFFFFFF  CACACACACACACACA     49
...             ...       ...    ...       ...               ...    ...
Sriram      9208196   9208203  14054   MMMMMMM    CACACACACACATX     49
Trinton    32822294  32822302  16069  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita       10241625  10241632  14075   FFFFFFF    CACACACACANYNY     49
Yoni        6439146   6439154  16060  MMMMMMMM  CACACACACACAFLFL     49
Zuleima     3521366   3521373  14050   FFFFFFF    AZCACACACACACA     49

[66 rows x 6 columns]

### Step 12. What is the standard deviation of names?

In [34]:
name.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [30]:
baby_names.describe()

         Unnamed: 0            Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830990e+06  2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  1.652476e+06  3.138293e+00  9.739735e+01
min    1.134900e+04  1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317326e+06  1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811920e+06  2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242554e+06  4.242556e+06  2.012000e+03  2.600000e+01
max    5.647425e+06  5.647426e+06  2.014000e+03  4.167000e+03